app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["content", "df"], ["created_at", 2017-04-10 21:34:07 UTC], ["updated_at", 2017-04-10 21:34:07 UTC]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id]
    @comment.save