app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = ? LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def index
    @posts = Post.all
    @post = Post.new
    @posts_love = @posts.where(category_id: 1)
    @posts_life = @posts.where(category_id: 2)
    @posts_serious = @posts.where(category_id: 3)
    @comment = Comment.new
    @categories = Category.all

SELECT "categories".* FROM "categories"
---
  def new
    @post = Post.new
    @categories = Category.all

INSERT INTO "posts" ("category_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["title", "dff"], ["content", "dfd"], ["created_at", 2017-04-04 11:28:56 UTC], ["updated_at", 2017-04-04 11:28:56 UTC]]
---
  def create
    post = Post.new(post_params)
    post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "오늘은sd"], ["content", "s무엇을할까요dsfsdfdsdsd"], ["updated_at", 2017-04-09 09:39:05 UTC], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.delete